MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GP304/mcu.h
#define _RSCON_RSE1_POSITION                     0x00000001
#define _RSCON_RSE1_MASK                         0x00000002
#define _RSCON_RSE1_LENGTH                       0x00000001

#define _RSCON_RSE2_POSITION                     0x00000002
#define _RSCON_RSE2_MASK                         0x00000004
#define _RSCON_RSE2_LENGTH                       0x00000001

#define _RSCON_RSE3_POSITION                     0x00000003
#define _RSCON_RSE3_MASK                         0x00000008
#define _RSCON_RSE3_LENGTH                       0x00000001

#define _RSCON_RSE4_POSITION                     0x00000004
#define _RSCON_RSE4_MASK                         0x00000010
#define _RSCON_RSE4_LENGTH                       0x00000001

#define _RSCON_RSE5_POSITION                     0x00000005
#define _RSCON_RSE5_MASK                         0x00000020
#define _RSCON_RSE5_LENGTH                       0x00000001

#define _RSCON_RSE6_POSITION                     0x00000006
#define _RSCON_RSE6_MASK                         0x00000040
#define _RSCON_RSE6_LENGTH                       0x00000001

#define _RSCON_RSE7_POSITION                     0x00000007
#define _RSCON_RSE7_MASK                         0x00000080
#define _RSCON_RSE7_LENGTH                       0x00000001

#define _RSCON_RSE8_POSITION                     0x00000008
#define _RSCON_RSE8_MASK                         0x00000100
#define _RSCON_RSE8_LENGTH                       0x00000001

#define _RSCON_RSE9_POSITION                     0x00000009
#define _RSCON_RSE9_MASK                         0x00000200
#define _RSCON_RSE9_LENGTH                       0x00000001

#define _RSCON_RSE10_POSITION                    0x0000000A
#define _RSCON_RSE10_MASK                        0x00000400
#define _RSCON_RSE10_LENGTH                      0x00000001

#define _RSCON_RSE11_POSITION                    0x0000000B
#define _RSCON_RSE11_MASK                        0x00000800
#define _RSCON_RSE11_LENGTH                      0x00000001

#define _RSCON_RSE12_POSITION                    0x0000000C
#define _RSCON_RSE12_MASK                        0x00001000
#define _RSCON_RSE12_LENGTH                      0x00000001

#define _RSCON_RSE13_POSITION                    0x0000000D
#define _RSCON_RSE13_MASK                        0x00002000
#define _RSCON_RSE13_LENGTH                      0x00000001

#define _RSCON_RSE14_POSITION                    0x0000000E
#define _RSCON_RSE14_MASK                        0x00004000
#define _RSCON_RSE14_LENGTH                      0x00000001

#define _RSCON_RSE15_POSITION                    0x0000000F
#define _RSCON_RSE15_MASK                        0x00008000
#define _RSCON_RSE15_LENGTH                      0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

#define _TRISA_TRISA3_POSITION                   0x00000003
#define _TRISA_TRISA3_MASK                       0x00000008
#define _TRISA_TRISA3_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _TRISA_TRISA7_POSITION                   0x00000007
#define _TRISA_TRISA7_MASK                       0x00000080
#define _TRISA_TRISA7_LENGTH                     0x00000001

#define _TRISA_TRISA8_POSITION                   0x00000008
#define _TRISA_TRISA8_MASK                       0x00000100
#define _TRISA_TRISA8_LENGTH                     0x00000001

#define _TRISA_TRISA9_POSITION                   0x00000009
#define _TRISA_TRISA9_MASK                       0x00000200
#define _TRISA_TRISA9_LENGTH                     0x00000001

#define _TRISA_TRISA10_POSITION                  0x0000000A
#define _TRISA_TRISA10_MASK                      0x00000400
#define _TRISA_TRISA10_LENGTH                    0x00000001

#define _PORTA_RA0_POSITION                      0x00000000
#define _PORTA_RA0_MASK                          0x00000001
#define _PORTA_RA0_LENGTH                        0x00000001

#define _PORTA_RA1_POSITION                      0x00000001
#define _PORTA_RA1_MASK                          0x00000002
#define _PORTA_RA1_LENGTH                        0x00000001

#define _PORTA_RA2_POSITION                      0x00000002
#define _PORTA_RA2_MASK                          0x00000004
#define _PORTA_RA2_LENGTH                        0x00000001

#define _PORTA_RA3_POSITION                      0x00000003
#define _PORTA_RA3_MASK                          0x00000008
#define _PORTA_RA3_LENGTH                        0x00000001

#define _PORTA_RA4_POSITION                      0x00000004
#define _PORTA_RA4_MASK                          0x00000010
#define _PORTA_RA4_LENGTH                        0x00000001

#define _PORTA_RA7_POSITION                      0x00000007
#define _PORTA_RA7_MASK                          0x00000080
#define _PORTA_RA7_LENGTH                        0x00000001

#define _PORTA_RA8_POSITION                      0x00000008
#define _PORTA_RA8_MASK                          0x00000100
#define _PORTA_RA8_LENGTH                        0x00000001

#define _PORTA_RA9_POSITION                      0x00000009
#define _PORTA_RA9_MASK                          0x00000200
#define _PORTA_RA9_LENGTH                        0x00000001

#define _PORTA_RA10_POSITION                     0x0000000A
#define _PORTA_RA10_MASK                         0x00000400
#define _PORTA_RA10_LENGTH                       0x00000001

#define _LATA_LATA0_POSITION                     0x00000000
#define _LATA_LATA0_MASK                         0x00000001
#define _LATA_LATA0_LENGTH                       0x00000001

